# Task 2

### R-Programming: Read EmployeeData xlsx file (3 sheets)

In [22]:
# Import libraries
library("readxl")
library("writexl")
library("dplyr")

In [3]:
excel_sheets(path = "../Data/EmployeeData.xlsx")

[1] "IT"      "Admin"   "Support"

In [4]:
IT= read_excel("../Data/EmployeeData.xlsx",sheet = "IT")
Admin= read_excel("../Data/EmployeeData.xlsx",sheet = "Admin")
Support= read_excel("../Data/EmployeeData.xlsx",sheet = "Support")

In [5]:
IT

  Name       Dept Salary RcvDate
1 Vertie     IT    3000  2018-08-05
2 Charlsie   IT    2000  2018-08-05
3 Manual     IT    4000  2018-08-05
4 Trudi      IT    6000  2018-08-05
5 Chong      IT    5600  2018-08-05
6 Chong      IT    5600  2018-08-06
7 Vertie     IT    3000  2018-08-06
8 Deedee     IT   20000  2018-08-06

In [6]:
Admin

   Name        Dept  Salary RcvDate
1  Ramonita    Admin 9500   2018-08-06
2  Terica      Admin 8900   2018-08-06
3  Hyman       Admin 7200   2018-08-06
4  Alysha      Admin 4400   2018-08-06
5  Tabitha     Admin 6500   2018-08-06
6  Mackenzie   Admin 8700   2018-08-06
7  Amparo      Admin 9100   2018-08-06
8  Tabitha     Admin 6500   2018-08-06
9  Burl        Admin 6000   2018-08-06
10 Pok         Admin 5600   2018-08-06
11 Junie       Admin 9500   2018-08-06
12 Rodrick     Admin 8900   2018-08-06

In [7]:
Support

  Name     Dept    Salary RcvDate
1 Maryln   Support 7200   2018-08-06
2 Tina     Support 4400   2018-08-07
3 Wilson   Support 6500   2018-08-07
4 Manual   Support 7600   2018-08-07
5 Deedee   Support 8200   2018-08-07
6 Maryln   Support 7200   2018-08-07

### a. Add all files

In [8]:
data = rbind(IT, Admin,Support)

### b. File has fields: Name | Dept | RcvDate

In [9]:
data

   Name        Dept    Salary RcvDate
1  Vertie      IT       3000  2018-08-05
2  Charlsie    IT       2000  2018-08-05
3  Manual      IT       4000  2018-08-05
4  Trudi       IT       6000  2018-08-05
5  Chong       IT       5600  2018-08-05
6  Chong       IT       5600  2018-08-06
7  Vertie      IT       3000  2018-08-06
8  Deedee      IT      20000  2018-08-06
9  Ramonita    Admin    9500  2018-08-06
10 Terica      Admin    8900  2018-08-06
11 Hyman       Admin    7200  2018-08-06
12 Alysha      Admin    4400  2018-08-06
13 Tabitha     Admin    6500  2018-08-06
14 Mackenzie   Admin    8700  2018-08-06
15 Amparo      Admin    9100  2018-08-06
16 Tabitha     Admin    6500  2018-08-06
17 Burl        Admin    6000  2018-08-06
18 Pok         Admin    5600  2018-08-06
19 Junie       Admin    9500  2018-08-06
20 Rodrick     Admin    8900  2018-08-06
21 Maryln      Support  7200  2018-08-06
22 Tina        Support  4400  2018-08-07
23 Wilson      Support  6500  2018-08-07
24 Manual      Support  7600  2018-08-07
25 Deedee      Support  8200  2018-08-07
26 Maryln      Support  7200  2018-08-07

In [10]:
write_xlsx(data,"../EmployeeData_processed.xlsx")

### c. Remove Duplicate Records based on Key (Name, Dept, Salary)

In [11]:
dim(data)

[1] 26  4

In [12]:
Unique_data = distinct(data,Name, Dept, Salary)

In [13]:
dim(Unique_data)

[1] 22  3

In [14]:
Unique_data

   Name        Dept    Salary
1  Vertie      IT       3000
2  Charlsie    IT       2000
3  Manual      IT       4000
4  Trudi       IT       6000
5  Chong       IT       5600
6  Deedee      IT      20000
7  Ramonita    Admin    9500
8  Terica      Admin    8900
9  Hyman       Admin    7200
10 Alysha      Admin    4400
11 Tabitha     Admin    6500
12 Mackenzie   Admin    8700
13 Amparo      Admin    9100
14 Burl        Admin    6000
15 Pok         Admin    5600
16 Junie       Admin    9500
17 Rodrick     Admin    8900
18 Maryln      Support  7200
19 Tina        Support  4400
20 Wilson      Support  6500
21 Manual      Support  7600
22 Deedee      Support  8200

### d. Club data by Dept and show output as: Dept | Salary Range | Num of Employees

In [20]:
df1 = group_by(Unique_data,Dept) %>% summarise(Minimum_Salary = min(Salary),Maximum_Salary = max(Salary))

In [21]:
df1

  Dept    Minimum_Salary Maximum_Salary
1 Admin   4400            9500
2 IT      2000           20000
3 Support 4400            8200

In [24]:
library("plyr")
df2 = count(Unique_data,"Dept")
df2

  Dept    freq
1 Admin   11
2 IT       6
3 Support  5

In [27]:
df3 = merge(df1, df2, by.x="Dept", by.y="Dept")

In [39]:
df3$SalaryRange=paste(df3$Minimum_Salary,"-",df3$Maximum_Salary)

In [40]:
df3

  Dept    Minimum_Salary Maximum_Salary freq SalaryRange
1 Admin   4400            9500          11   4400 - 9500
2 IT      2000           20000           6   2000 - 20000
3 Support 4400            8200           5   4400 - 8200

In [50]:
df4=rename(df3, c("freq"="Num_of_Employees"))

In [52]:
data_final = select(df4,-Minimum_Salary,-Maximum_Salary)

In [53]:
data_final

  Dept    Num_of_Employees SalaryRange
1 Admin   11               4400 - 9500
2 IT       6               2000 - 20000
3 Support  5               4400 - 8200

# The End